{"data":[{
      "message": "Name: Bill Thompson\nHometown: Clifton Heights, PA\nHigh School: Upper Darby\nMajor: Chemical Engineering\nSports: don't play but watch football, baseball, basketball\nDo you drink: yes\nDo you party: no\nSmoke: occasionally \nReligion:   not religious\nDo you regularly attend: na\nNight person/ early person: In between\nDo you listen to music when you study: yes, with headphones\nDo you sleep with any lights on or do you need lights off: i can if needed\nHow important are your grades: very\nHow do you like to study: anyway that works\nMind having people in your room: no\nFavorite hobbies: music, tv, being with friends\nFavorite TV shows: HIMYM, Big Bang Theory, Sports shows.\nFavorite music: Rap (Jcole, Kendrick, Ab-Soul, Wale, Nas, 2chainz)\nHow do you feel about sharing possessions: Its fine if kept in good condition\nWhat activities do you want to do at WPI: I honestly don't know. I'm willing to try anything but track (not a fan of running lol)\nWhat do you consider clean: Smells good, trash is in the can, floor is at least walkable on.\nDo you plan on working: yes\nOutgoing or shy: shy-ish\nTalkative or quiet: talkative in small groups, quiet in larger\nLinks to any social networking site that would add more info: (Pinterest, Tumblr, Reddit, Twitter, etc.) nope \nWhat is your stance on overnight guests (Whether it be girlfriends/boyfriends or friends visiting from home): As long as I know ahead of time its fine.\nWhat are you looking for in a roommate: Someone that shares interests in sports and music. Fun to be around. More outgoing than shy.\nWhat room style do you want (double, triple, etc): doesn't matter", 
      "id": "283769558453627_283780871785829", 
      "updated_time": "2014-04-09T02:42:47+0000"
    }, 
    {
      "message": "Name: Brandon King\nHometown: Hamden, CT\nHigh School: Hamden HS\nMajor: Civil Engineering\nSports: Track and Field - Shotput (possibly)\nDo you drink: no\nDo you party: sometimes\nSmoke: no\nReligion: Catholic\nDo you regularly attend: NA\nNight person: yes\nEarly person: yes\nDo you listen to music when you study: yes, unless I'm reading\nDo you sleep with any lights on or do you need lights off: doesn't matter, if I'm tired I'll fall asleep.\nHow important are your grades: Very important\nHow do you like to study: usually in a small group, quizzing eachother etc.\nMind having people in your room: not at all, just keep it down if I'm asleep.\nFavorite hobbies: playing sports, being active, hanging with friends.\nFavorite TV shows: Weeds, Doctor who, and possibly family guy.\nFavorite music: Pop - anything really - not picky at all\nHow do you feel about sharing possessions: Don't mind as long as nothing is broken.\nWhat activities do you want to do at WPI? Engineering without borders, possibly track and field thrower, club sports, possibly joining fraternity.\nWhat do you consider clean: Food stored properly - close on the floor don't mind really\nDo you plan on working: Yes\nOutgoing or shy: In most situations I'm outgoing\nTalkative or quiet: I tend to be talkative but in some situations I can be quiet.\nWhat is your stance on overnight guests: don't mind whatsoever as long as I'm not kept up all night\nWhat are you looking for in a roommate: someone that is laid back - doesn't mind being up late every once in a while. Able to be outgoing and meet new people. (Everyone's a little shy - so being shy is fine but more outgoing then shy preferred)\nWhat room style do you want: Doesn't make a difference to me.", 
      "id": "283769558453627_283779238452659", 
      "updated_time": "2014-04-09T02:34:38+0000"
    },
    {
      "message": "Name: Kevin Walsh\nHometown: Medfield, MA\nHigh School: Medfield High School\nMajor: undecided engineering\nSports: played football, plan on throwing for track, and maybe doing club hockey or rugby\nDo you drink: yes\nDo you party: sometimes\nSmoke: no\nReligion: Do you regularly attend: Christian and youth-group member\nNight person/ early person: night\nDo you listen to music when you study: sometimes\nDo you sleep with any lights on or do you need lights off: lights off\nHow important are your grades: pretty important\nHow do you like to study: doesn't matter\nMind having people in your room: no\nFavorite hobbies: listening to music, sports with friends, tv/videogames\nFavorite TV shows: Archer, Walking dead, Parks and Rec, pretty much anything comedy\nFavorite music: Classic rock and rap/hip-hop\nHow do you feel about sharing possessions: as long as its returned in one piece.\nWhat activities do you want to do at WPI: Rush a fraternity, track, maybe club sports and maybe other clubs.\nWhat do you consider clean: If it doesn't smell and I don't have to walk over stuff\nDo you plan on working: maybe\nOutgoing or shy: A little shy at first but outgoing once I'm comfortable around you\nTalkative or quiet: talkative\nLinks to any social networking site that would add more info: (Pinterest, Tumblr, Reddit, Twitter, etc.) twitter is @_KWalsh_ (beware of some political tweets and FB posts)\nWhat is your stance on overnight guests: (Whether it be girlfriends/boyfriends or friends visiting from home) as long as it's not every night keeping me up all night.\nWhat are you looking for in a roommate: Someone easy going who can talk sports or music.\nWhat room style do you want (double, triple, etc): Idc", 
      "id": "283769558453627_283774815119768", 
      "updated_time": "2014-04-09T02:17:28+0000"
    }, 
    {
      "message": "Hometown: Titusville, NJ\nHigh School: Hopewell Valley Central HS\nMajor: Computer Science and/or Robotics\nSports: Ultimate Frisbee, Hurdles\nDo you drink: no\nDo you party: I'm a nerd raver, so sorta\nSmoke: no\nReligion: athiest\nDo you regularly attend: NA\nNight person: yes\nEarly person: no\nDo you listen to music when you study: yes, unless I'm reading\nDo you sleep with any lights on or do you need lights off: absolutely completely off\nHow important are your grades: second only to future employment\nHow do you like to study: usually with one or two friends talking and quizzing, but early on I just like to read whatever material is relevent\nMind having people in your room: not unless I'm sleeping\nFavorite hobbies: programming, piano, guitar, fire poi\nFavorite TV shows: Doctor Who, Sherlock, HIMYM\nFavorite music: Electus, MeaCulpa, Sizzlebird, Driftless Pony Club\nHow do you feel about sharing possessions: not opposed to sharing food, clothes, and electronics.\nWhat activities do you want to do at WPI? Ultimate Frisbee, anything with robots, engineers without borders, and maybe some music here and there\nWhat do you consider clean: clothes on the floor is ok as long as it doesn't smell. Food should be kept stored.\nDo you plan on working: not unless its an internship\nOutgoing or shy: Outgoing but not obnoxiously so\nTalkative or quiet: talkative, but it depends on the subject\nWhat is your stance on overnight guests: as long as its not too loud. I'd want them to do that same for me.\nWhat are you looking for in a roommate: someone who doesn't mind having an automation system setup. This may or may not include robotic ceiling fan, and a voice-control interface.\nWhat room style do you want: double", 
      "id": "283769558453627_283775561786360", 
      "updated_time": "2014-04-09T02:13:33+0000"
    }, 
    {
      "message": "I believe this group would be more appropriately labeled of it were renamed to WPI Class of 2018 MEN", 
      "id": "283769558453627_283773805119869", 
      "updated_time": "2014-04-09T02:12:35+0000"
    }
  ]
}